import psycopg2
import redis

token = '422552467:AAFt-9mIGk8nh_IuHqQmMJkM9ZDGyj7rVdU'
base_url = 'http://www.lp.edu.ua/rozklad-dlya-studentiv'
db_conn = psycopg2.connect(dbname='nulp_bot', user='nulp_bot', host='nulpbot.ckclwywyrho2.eu-central-1.rds.amazonaws.com', password='nulp_bot')
redis_db = redis.StrictRedis(host='nulpbot.ihnlu8.ng.0001.euc1.cache.amazonaws.com')

updateMessage = '*Псссс, {}. Я тут підучив деякі нові фішки*😏\n\n' \
                'Тепер я вмію робити сальтушку і сідати на шпагат! Круто?\n\n'\
                'Ну і ще дещо:\n_- можу надсилати розклад щовечора o 21:00 '\
                'на наступний день\n- подарували підручник з української мови. '\
                'Тепер менше помилок👌_\n\n' \
                'Щоб отримувати сповіщення, перейди до пункту "Сповіщення" у меню налаштувань.\n\n' \
                'У наступних оновленнях очікуйте розклад екзаменів та калькулятор середнього балу.\n\n' \
                '*P.S. Також не забувай розповідати про мене своїм одногрупникам/одногрупницям та друзям😉\n\n' \
                'Вам зручно - мені приємно*'

messages = {
    'mainMenu': 'Обери один з пунктів меню:',
    'buildingsMenu': 'Який навчальний корпус ти шукаєш?',
    'back': '⬅️ Назад',
    'greeting': '*Привіт, {}!*\n\nЯ знаю розклад занять будь-якої групи у твоєму універі.\n'
                'Нудна робота, але що поробиш... таким мене створили 😥\n\n\n'
                'Також я добре орієнтуюсь на території твого "улюбленого" універу, тому можеш питати, якщо '
                'не знаєш, де знаходиться потрібний корпус 😉\n\n_Мій батько - @vinyunya_\n\n'
                'Давай познайомимось трішки поближче 😏',
    'changeInstitute': 'З якого ти інституту?',
    'changeFaculty': 'Який напрям?',
    'changeGroupNumber': 'Який номер групи?',
    'changeSubgroupNumber': 'Яка підгрупа?',
    'wrongInstitute': 'Ти походу з ЛНУ... У нас немає такого закладу 😥\nСпробуй ще раз!',
    'wrongFaculty': 'Я незнаю такого напряму 😥\nСпробуй ще раз!',
    'wrongGroupNumber': 'Я незнаю такої групи 😥\nСпробуй ще раз!',
    'wrongSubgroupNumber': 'Обери першу або другу підгрупу',
    'saveChanges': '*Я запам\'ятав*👌\nВідтепер ти зможеш запитувати у мене розклад ще швидше 😉\n\n'
                   'Для швидкого доступу скористайся такими командами:\n/today - розклад на сьогодні;\n'
                   '/tomorrow - розклад на завтра;\n/week - розклад на цей тиждень;\n'
                   '/nextweek - розклад на наступний тиждень.\n\n'
                   'Якщо бажаєш автоматично отримувати розклад на наступний день в будні о 21:00 - перейди до пункту '
                   '"Сповіщення" у меню налаштувань.\n\n'
                   'Також ти маєш можливість зробити це за допомогою меню',
    'go': 'Продовжити',
    'menu': 'Меню',
    'schedule': 'На який день/тиждень тобі потрібен розклад?',
    'todaySchedule': 'РОЗКЛАД ЗАНЯТЬ НА СЬОГОДНІ\n{}',
    'tomorrowSchedule': 'РОЗКЛАД ЗАНЯТЬ НА ЗАВТРА\n{}',
    'thisWeekSchedule': '➖➖➖➖➖➖➖➖➖➖➖➖➖\n'
                        'РОЗКЛАД ЗАНЯТЬ НА ЦЕЙ ТИЖДЕНЬ\n{}\n'
                        '➖➖➖➖➖➖➖➖➖➖➖➖➖',

    'nextWeekSchedule': '➖➖➖➖➖➖➖➖➖➖➖➖➖\n'
                        'РОЗКЛАД ЗАНЯТЬ НА НАСТУПНИЙ ТИЖДЕНЬ\n{}\n'
                        '➖➖➖➖➖➖➖➖➖➖➖➖➖',
    'bothSubgroups': 'Я всюди встигаю',
    'successfullyUpdatedSubgroup': '*Я оновив підгрупу*\n\n'
                                   'Відтепер розклад буде відображатись лише для обраної підгрупи.',
    'todayIsWeekend': '*СЬОГОДНІ ВИХІДНИЙ!!!! ГУЛЯЯЯЯЄЄЄМ🎊🎊🔥🤩🎉🎊🎉🤩🤩🎊🔥🤩🤩🔥🎉🎊🎊🔥🤩*',
    'tomorrowIsWeekend': '*ЗАВТРА ВИХІДНИЙ!!!! ГУЛЯЯЯЯЄЄЄМ🎊🎊🔥🤩🎉🎊🎉🤩🤩🎊🔥🤩🤩🔥🎉🎊🎊🔥🤩*',
    'noUser': '*Ти ще не розказав у якій ти групі навчаєшся...*\n\n'
              'Перейди то меню налаштувань та перейди до пункту "Змінити групу"',
    'photoAnswer': 'Ти чекаєш поки я скину фотки там де я голий?',
    'textAnswer': 'Розмовляй солов\'їною і зрозумілою для мене мовою!!!',
    'locationAnswer': 'Я тебе знайду і розцілую😘',
    'stickerAnswer': 'Я так не вмію(',
    'videoAnswer': 'Тарантіно нєрвно курить в сторонці...',
    'otherAnswer': 'Що це?!',
    'contactAnswer': 'Краще розкажи йому/їй про мене)',
    'toggleNotifications': 'Ти хочеш отримувати розклад на наступний день о 21:00 в будні?',
    'saveNotifications': '*Я запам\'ятав*👌\n\nЩоб викликати головне меню, введіть команду - /menu'
}

days = ['понеділок', 'вівторок', 'середа', 'четвер', 'п\'ятниця']

notification_buttons = ['Так, хочу', 'Ні, нехочу']

schedule_menu = [{
    'name': '⬅️ Назад',
    'value': 'back'
}, {
    'name': 'Сьогодні',
    'value': 'today'
}, {
    'name': 'Завтра',
    'value': 'tomorrow'
}, {
    'name': 'Цей тиждень',
    'value': 'week'
}, {
    'name': 'Наступний тиждень',
    'value': 'nextweek'
}]

main_menu = [{
    'name': u'\u23F0  Розклад занять',
    'value': 'schedule'
}, {
    'name': u'🏫  Навчальні корпуси',
    'value': 'buildings'
}, {
    'name': u'⚙️  Налаштування',
    'value': 'settings'
}]

time_schedule = ['8:30 − 10:05', '10:20 − 11:55', '12:10 − 13:45', '14:15 − 15:50', '16:00 − 17:35', '17:40 − 19:15',
                 '19:20 − 20:55', '21:00 − 22:35']

settings_menu = [messages['back'], 'Змінити групу', 'Змінити підгрупу', 'Сповіщення']

subgroup_defined_schedule_template = u'\n\n{} ПАРА\n📚 ПРЕДМЕТ: {}\n👨‍🏫 ВИКЛАДАЧ: {}\n' \
                                     u'🏫 АУДИТОРІЯ: {}\n🕑 ЧАС: {}'

subgroup_undefined_schedule_template = u'\n\n{0} ПАРА  |  {5} ПІДГРУПА\n📚 ПРЕДМЕТ: {1}\n' \
                                       u'👨‍🏫 ВИКЛАДАЧ: {2}\n🏫 АУДИТОРІЯ: {3}\n🕑 ЧАС: {4}'

emoji_digits = [u'1️⃣', u'2️⃣', u'3️⃣', u'4️⃣', u'5️⃣', u'6️⃣', u'7️⃣', u'8️⃣']

buildings = [{
    'name': 'Головний корпус',
    'address': 'вул. Степана Бандери, 12',
    'lat': 49.835818,
    'lng': 24.014563
}, {
    'name': 'Навчальний корпус №1',
    'address': 'вул. Карпінського, 2/4',
    'lat': 49.835586,
    'lng': 24.010258
}, {
    'name': 'Навчальний корпус №2',
    'address': 'вул. Карпінського, 6',
    'lat': 49.836293,
    'lng': 24.012414
}, {
    'name': 'Навчальний корпус №3',
    'address': 'пл. Святого Юра, 1',
    'lat': 49.836591,
    'lng': 24.013542
}, {
    'name': 'Навчальний корпус №4',
    'address': 'вул. Митрополита Андрея, 3',
    'lat': 49.836415,
    'lng': 24.011146
}, {
    'name': 'Навчальний корпус №5',
    'address': 'вул. Степана Бандери, 28а',
    'lat': 49.835146,
    'lng': 24.008378
}, {
    'name': 'Навчальний корпус №6',
    'address': 'вул. Степана Бандери, 32',
    'lat': 49.835352,
    'lng': 24.006242
}, {
    'name': 'Навчальний корпус №7',
    'address': 'вул. Степана Бандери, 55',
    'lat': 49.834528,
    'lng': 24.009764
}, {
    'name': 'Навчальний корпус №8',
    'address': 'вул. Шептицьких 3/4',
    'lat': 49.837538,
    'lng': 24.012450
}, {
    'name': 'Навчальний корпус №9',
    'address': 'пл. Святого Юра, 9',
    'lat': 49.836449,
    'lng': 24.014161
}, {
    'name': 'Навчальний корпус №10',
    'address': 'вул. Устіяновича, 5',
    'lat': 49.836340,
    'lng': 24.015168
}, {
    'name': 'Навчальний корпус №11',
    'address': 'вул. Професорська, 2',
    'lat': 49.835882,
    'lng': 24.016043
}, {
    'name': 'Навчальний корпус №14',
    'address': 'вул. Степана Бандери, 8',
    'lat': 49.835406,
    'lng': 24.017338
}, {
    'name': 'Навчальний корпус №15',
    'address': 'вул. Професорська, 1',
    'lat': 49.835686,
    'lng': 24.017059
}, {
    'name': 'Навчальний корпус №19',
    'address': 'вул. Князя Романа, 1-3',
    'lat': 49.838299,
    'lng': 24.033062
}, {
    'name': 'Навчальний корпус №28',
    'address': 'вул. Митрополита Андрея, 1',
    'lat': 49.836901,
    'lng': 24.012581
}, {
    'name': 'Навчальний корпус №33',
    'address': 'вул. Театральна, 11',
    'lat': 49.841092,
    'lng': 24.029978
}, {
    'name': 'Технічна бібліотека',
    'address': 'вул. Митрополита Андрея, 1',
    'lat': 49.836901,
    'lng': 24.012581
}, {
    'name': 'Наукова бібліотека',
    'address': 'вул. Професорська, 1',
    'lat': 49.835421,
    'lng': 24.016631
}, {
    'name': 'Інститут підприємництва та перспективних технологій',
    'address': 'вул. Горбачевського, 18',
    'lat': 49.828575,
    'lng': 24.009121
}, {
    'name': 'Інститут екології, природоохоронної дільності та туризму імені В. Чорновола',
    'address': 'вул. Генерала Чупринки, 130',
    'lat': 49.824216,
    'lng': 24.000974
}]
